#
#
# Дальше будет реализация через арифметические действия с присваиванием.
#
#  33. Создать переменную item_3 и присвоить ей целое число
item_3 = 10
#  34. Прибавить 10 к item_3 с присвоением.
item_3 += 10
#  35. Вывести item_3 в консоль.
print('item_3+10=',item_3)
#  36. Отнять 5 от item_3 с присвоением.
item_3 -= 5
#  37. Вывести item_3 в консоль.
print('item_3-5=',item_3)
#  38. Умножить item_3 на 3 с присвоением.
item_3 *= 3
#  39. Вывести item_3 в консоль.
print('item_3*3=',item_3)
#  40. Разделить item_3 на 2 с присвоением.
item_3 /= 2
#  41. Вывести item_3 в консоль.
print('item_3/2=',item_3)
#  42. Возвести в степень 2 item_3 с присвоением.
item_3  **= 2
#  43. Вывести item_3 в консоль.
print('item_3**2=',item_3)
#  44. Найти квадратный корень item_3 с присвоением.

item_3 **= 0.5
#  45. Вывести item_3 в консоль.
print('sqrt(item_3)=',item_3)
#  46. Присвоить остаток от деления item_3

#  47. Вывести item_3 в консоль.
print('item_3=',item_3)

#
# Boolean
#
#  48. Создать переменную b_item_t и присвоить True
b_item_t = True
#  49. Создать переменную b_item_f и присвоить False
b_item_f = False
#  50. Создать переменную b_item_relult_sum и присвоить сумму b_item_t и b_item_f
b_item_result_sum = b_item_t + b_item_f
#  51. Вывести b_item_relult_sum в консоль.
print("b_item_result_sum=",b_item_result_sum)
#  52. Создать переменную b_item_relult_subtr и присвоить разницу b_item_t и b_item_f
b_item_result_subtr = b_item_t - b_item_f
#  53. Вывести b_item_relult_subtr в консоль.
print("b_item_result_subtr=",b_item_result_sum)
#  54. Создать переменную b_item_relult_multi и присвоить умножение b_item_t и b_item_f
b_item_result_multi = b_item_t * b_item_f
#  55. Вывести b_item_relult_multi в консоль.
print("b_item_result_multi=",b_item_result_multi)
#  56. Создать переменную b_item_relult_division и присвоить деление b_item_t и b_item_f
b_item_result_division = b_item_t / b_item_f
#  57. Вывести b_item_relult_division в консоль. (Получить ошибку)
print("b_item_result_division=",b_item_result_division)
#  58. Создать переменную b_item_1_int и присвоить явное приведение b_item_t к int
b_item_1_int = int(b_item_t)
#  59. Вывести b_item_1_int в консоль.
print('int(b_item_t) =', b_item_1_int)
#  60. Создать переменную b_item_2_int и присвоить явное приведение b_item_2 к int
b_item_2_int = int(b_item_f)
#  # 61. Вывести b_item_2_int в консоль.
print('int(b_item_f) =', b_item_2_int)
